package CommadManager.Commands.ZeroArgumentCommands;

public class Help extends Command{

    @Override
    public String execute() {
        return "help : вывести справку по доступным командам\n" +
                "info : вывести в стандартный поток вывода информацию о коллекции (тип, дата инициализации, количество элементов и т.д.)\n" +
                "show : вывести в стандартный поток вывода все элементы коллекции в строковом представлении\n" +
                "add {element} : добавить новый элемент в коллекцию\n" +
                "update id {element} : обновить значение элемента коллекции, id которого равен заданному\n" +
                "remove_by_id id : удалить элемент из коллекции по его id\n" +
                "clear : очистить коллекцию\n" +
                "save : сохранить коллекцию в файл\n" +
                "execute_script file_name : считать и исполнить скрипт из указанного файла. В скрипте содержатся команды в таком же виде, в котором их вводит пользователь в интерактивном режиме.\n" +
                "exit : завершить программу (без сохранения в файл)\n" +
                "add_if_min {element} : добавить новый элемент в коллекцию, если его значение меньше, чем у наименьшего элемента этой коллекции\n" +
                "remove_greater {element} : удалить из коллекции все элементы, превышающие заданный\n" +
                "history : вывести последние 6 команд (без их аргументов)\n" +
                "filter_less_than_type type : вывести элементы, значение поля type которых меньше заданного\n" +
                "filter_greater_than_postal_address postalAddress : вывести элементы, значение поля postalAddress которых больше заданного\n" +
                "print_field_descending_annual_turnover : вывести значения поля annualTurnover всех элементов в порядке убывания";
    }
}
